src/cf/Documents/ДокуменФинасовогоСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДокуменФинасовогоСостояния</Name>
			<Comment>Фиксирует состояние на дату</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОбОстатках</xr:Item>
				<xr:Item>InformationRegister.СведенияОЗадолженностях</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИтоговыйБаланс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТекущийОстаок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектФиксацииОстатка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектФиксации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТекущаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектФиксацииЗадолженности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектФиксации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступнаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстатка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтоговаяСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ДокуменФинасовогоСостояния/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТекущаяЗадолженностьДоступнаяСуммаПриИзменении(Элемент)
	РасчетИтоговойСуммы ();
КонецПроцедуры    

&НаКлиенте
Процедура ТекущаяЗадолженностьСуммаОстаткаПриИзменении(Элемент)
	РасчетИтоговойСуммы ();
КонецПроцедуры

&НаКлиенте
Процедура РасчетИтоговойСуммы ()
	ТекущиеДанные = Элементы.ТекущаяЗадолженность.ТекущиеДанные;
	ТекущиеДанные.ИтоговаяСумма = ТекущиеДанные.ДоступнаяСумма - ТекущиеДанные.СуммаОстатка;
КонецПроцедуры	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РассчитатьИтогДокумента();	
КонецПроцедуры

&НаКлиенте
Процедура Расчитать(Команда)
	РассчитатьИтогДокумента();	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогДокумента()

	Объект.ИтоговыйБаланс = Объект.ТекущийОстаок.Итог("Сумма") - Объект.ТекущаяЗадолженность.Итог("ИтоговаяСумма");

КонецПроцедуры // РассчитатьИтогДокумента()
